tc4/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          49;
        startFace       1813;
    }
    bottom
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          49;
        startFace       1862;
    }
    rotatingWall
    {
        type            patch;
        nFaces          98;
        startFace       1911;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          98;
        startFace       2009;
    }
    frontAndBack
    {
        type            patch;
        nFaces          196;
        startFace       2107;
    }
)

// ************************************************************************* //
